tutorials/fluidSolidInteraction/ringAddedMass/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Quarter of the elastic ring, of mean radius 1 m and thickness 0.1 m. The
// n = 2 (ovalling) mode is symmetric about both axes, so only the first
// quadrant is modelled.

convertToMeters 1;

vertices
(
    (0.95 0 0)
    (1.05 0 0)
    (0 1.05 0)
    (0 0.95 0)
    (0.95 0 0.1)
    (1.05 0 0.1)
    (0 1.05 0.1)
    (0 0.95 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 48 1) simpleGrading (1 1 1)
);

edges
(
    arc 0 3 (0.67175144212722 0.67175144212722 0)
    arc 1 2 (0.74246212024587 0.74246212024587 0)
    arc 4 7 (0.67175144212722 0.67175144212722 0.1)
    arc 5 6 (0.74246212024587 0.74246212024587 0.1)
);

patches
(
    patch interface
    (
        (1 2 6 5)
    )
    patch inside
    (
        (0 4 7 3)
    )
    symmetry bottom
    (
        (0 1 5 4)
    )
    symmetry left
    (
        (3 7 6 2)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
