tutorials/fluidSolidInteraction/ringAddedMass/constant/fsiProperties
fsiProperties.iqnils