tutorials/fluidSolidInteraction/ringAddedMass/constant/fsiProperties.iqnils
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    IQNILS;

IQNILSCoeffs
{
    // Interface patches
    solidPatch interface;
    fluidPatch interface;

    // Predictors at the start of a new time step
    predictor            yes;
    predictSolid         yes;

    // Under-relaxation factor for the second iteration of each time-step (the
    // first is not relaxed with predictor yes), after which the IQNILS
    // procedure is used
    relaxationFactor     0.05;

    // Tolerance for the FSI loop within each time-step
    outerCorrTolerance   1e-6;

    // Maximum number of outer FSI loop correctors within each time-step
    nOuterCorr           100;

    // Enable/disable coupling from the start
    coupled              yes;

    // Method for transferring information between the interfaces
    interfaceTransferMethod directMap;

    // Write fsi residuals to file
    writeResidualsToFile yes;
}

// ************************************************************************* //
