tutorials/fluidSolidInteraction/ringAddedMass/constant/solid/solidProperties
solidProperties.highOrder