tutorials/fluidSolidInteraction/ringAddedMass/constant/solid/solidProperties.highOrder
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel     linearGeometryTotalDisplacement;

linearGeometryTotalDisplacementCoeffs
{
    // Solution algorithm
    solutionAlgorithm PETScSNES;

    // Predictor D at the start of a new time step using U and A
    predictor yes;

    // Cubic reconstruction of the displacement in the residual. The Jacobian
    // (preconditioner) is the standard compact one
    highOrderCoeffs
    {
        highOrderJacobian false;
        highOrderResidual true;

        displacement
        {
            type movingLeastSquares;
            polynomialOrder 3;
            faceStencilExtraCells 15;
            weightFunctionCoeffs
            {
                type radiallySymmetricExponential;
                k 6;
            }
            calcConditionNumber false;
        }
    }

    stabilisation
    {
        momentum
        {
            type        alpha;
            scaleFactor 0.1;
        }
    }
}

// ************************************************************************* //
