tutorials/fluidSolidInteraction/ringAddedMass/constant/solid/solidProperties.standard
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel     linearGeometryTotalDisplacement;

linearGeometryTotalDisplacementCoeffs
{
    // Solution algorithm
    solutionAlgorithm PETScSNES;

    // Predictor D at the start of a new time step using U and A
    predictor yes;

    // Stabilisation
    stabilisation
    {
        momentum
        {
            type        diffStencilLaplacian;
            scaleFactor 0.5;
        }
    }
}

// ************************************************************************* //
