tutorials/fluidSolidInteraction/ringAddedMass/0/fluid/U.robin
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    interface
    {
        type            elasticWallVelocity;
        value           uniform (0 0 0);
    }
    outerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            symmetry;
    }
    left
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
